{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import re\n",
    "import sys\n",
    "from py2neo import Graph,Node,Relationship,NodeMatcher\n",
    "import numpy as np\n",
    "from scipy import spatial\n",
    "import gensim\n",
    "import jieba\n",
    "import numpy as np\n",
    "from scipy.linalg import norm\n",
    "from fuzzywuzzy import process\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"\n",
    "函数说明：输入一个字符串，返回图查询的结果\n",
    "\n",
    "\"\"\"\n",
    "def get_Answer(string):\n",
    "    graph = Graph(host=\"10.88.3.81\",auth=(\"neo4j\",\"liubaichuan\"))\n",
    "    data1 = graph.run(string).to_data_frame()\n",
    "    return data1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "'''\n",
    "函数说明：\n",
    "用于语句计算相似度的函数\n",
    "'''\n",
    "model_file = '/Users/dong/Desktop/GoogleNews-vectors-negative300.bin'\n",
    "model = gensim.models.KeyedVectors.load_word2vec_format(model_file, binary=True)\n",
    "index2word_set = set(model.index2word)\n",
    "\n",
    "def avg_feature_vector(sentence, model, num_features, index2word_set):\n",
    "    words = sentence.split()\n",
    "    feature_vec = np.zeros((num_features, ), dtype='float32')\n",
    "    n_words = 0\n",
    "    for word in words:\n",
    "        if word in index2word_set:\n",
    "            n_words += 1\n",
    "            feature_vec = np.add(feature_vec, model[word])\n",
    "    if (n_words > 0):\n",
    "        feature_vec = np.divide(feature_vec, n_words)\n",
    "    return feature_vec"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "'''\n",
    "函数说明：导入所有问题模板\n",
    "输入：\"question_pattern.txt\"\n",
    "输出：所有问题组成的list\n",
    "'''\n",
    "def qPattern(a):\n",
    "    qList=[]\n",
    "    with open(a, 'r') as file:\n",
    "        for l in  file:\n",
    "            qList.append(l.strip('\\n'))\n",
    "    return(qList)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "'''\n",
    "问题预处理，将一些无法被识别的sequence变成id，增强对问题类型的识别能力\n",
    "protein:{id}   Q03073\n",
    "Species{name}\n",
    "Gene:{id: 'AET4Gv20696400', species: 'Aegilops tauschii'})\n",
    "GO:{id: 'GO:1902494'})(_204455104:GO {id: 'GO:0004553'}\n",
    "Sequence:UPI00013ED01D\n",
    "'''\n",
    "def realQ(Question):\n",
    "    verb=Question.split()\n",
    "    for i in verb:\n",
    "        if str(i).lstrip('[\\'').rstrip('\\']').strip('{').strip('}').strip('(').strip(')').isalpha():\n",
    "            continue\n",
    "        elif str(i).lstrip('[\\'').rstrip('\\']').strip('{').strip('}').strip('(').strip(')').isalnum():\n",
    "            if str(i).lstrip('[\\'').rstrip('\\']').strip('{').strip('}').strip('(').strip(')').isdigit():\n",
    "                a=verb.index(i)\n",
    "                verb[a]='GO id'\n",
    "            elif str(i).lstrip('[\\'').rstrip('\\']').strip('{').strip('}').strip('(').strip(')').startswith(('AET','AMTR','g','Al','fgenesh1','fgenesh2','scaffold','AT','BVRB','BRADI','GSBRNA2T','Bo','Bra','CHLRE','CHC','CCACVL','Csa','CM','DCAR','Dr','Gasu','GLYMA','B456','HannXRQ','HORVU','LPERR','TanjilG','MANES','MTR','GSMUA','A4A49','OBART','OB','ORGLA','OGLUM','KN','AMD','OMERI','ONIVA','OPUNC','ORUFI','BGIOSGA','Os','OSTLU','PHAVU','Pp','POPTR','PRUPE','SELMODRAFT','SETIT','Solyc','PGS','SORBI')):\n",
    "                a=verb.index(i)\n",
    "                verb[a]='Gene id'\n",
    "            elif str(i).lstrip('[\\'').rstrip('\\']').strip('{').strip('}').strip('(').strip(')').startswith('UPI'):\n",
    "                a=verb.index(i)\n",
    "                verb[a]='Sequence id'\n",
    "            else:\n",
    "                a=verb.index(i)\n",
    "                verb[a]='Protein id'\n",
    "    realQ=' '.join(verb)\n",
    "    realQ=realQ.strip('{').strip('}').strip('(').strip(')')\n",
    "    return(realQ)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "'''\n",
    "函数说明：将问题和question_pattern计算相似度\n",
    "输入：question\n",
    "{AET4Gv20696400} comes from how many (Species)?\n",
    "what (genes) do {Aegilops tauschii} has?\n",
    "Gene Os01g0740400 is transcribed into what sequence?\n",
    "sequence UPI00004C2817 is transcribed from which gene?\n",
    "输出：相似度最大的问题的类型\n",
    "'''\n",
    "#Q='sequence UPI00004C2817 is transcribed from which gene?'\n",
    "#Question=realQ(Q)\n",
    "#qpattern_dir=\"question_pattern.txt\"\n",
    "def max_sim(Question,qpattern_dir):\n",
    "    m=qPattern(qpattern_dir)\n",
    "    obpattern = r'[\\]](.*?)[?]'\n",
    "    s0_afv = avg_feature_vector(Question, model=model, num_features=300, index2word_set=index2word_set)\n",
    "    simList=[]\n",
    "    for i in m:\n",
    "        text = i\n",
    "        patternObj = re.compile(obpattern)\n",
    "        result1 = str(patternObj.findall(text)).lstrip('[\\'').rstrip('\\']')\n",
    "        s1_afv = avg_feature_vector(result1, model=model, num_features=300, index2word_set=index2word_set)\n",
    "        sim = 1 - spatial.distance.cosine(s0_afv, s1_afv)\n",
    "        simList.append(sim)\n",
    "    #print(simList)  #查看相似度的数值\n",
    "    max_index=simList.index(max(simList))\n",
    "    text2=m[max_index]\n",
    "    pattern1 = r'[\\[](.*?)[\\]]'\n",
    "    patternObj2 = re.compile(pattern1)\n",
    "    result2 = patternObj2.findall(text2)\n",
    "    return(str(result2).lstrip('[\\'').rstrip('\\']'))\n",
    "#max_sim(Question,qpattern_dir)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "#模糊查询\n",
    "#适用于拼写少字母的情况\n",
    "def fuzzyfinder1(user_input, collection):\n",
    "        suggestions = []\n",
    "        pattern = '.*?'.join(user_input)    \n",
    "        regex = re.compile(pattern)         \n",
    "        for item in collection:\n",
    "            match = regex.search(item)      \n",
    "            if match:\n",
    "                suggestions.append(item)\n",
    "        a=sorted(suggestions)\n",
    "        return a[0]\n",
    "    \n",
    "#要是上面那个返回的是空就用下面这个，适用于拼写字母顺序个别出错\n",
    "from fuzzywuzzy import process\n",
    "def fuzzyfinder2(user_input, collection):\n",
    "    a=process.extractOne(user_input,collection)\n",
    "    return a[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "'''\n",
    "函数目标：\n",
    "输入问题，提取里面的实体，宽泛点~\n",
    ".啊啊啊啊\n",
    "protein:{id}   Q03073\n",
    "Species{name}\n",
    "Gene:{id: 'AET4Gv20696400', species: 'Aegilops tauschii'})\n",
    "GO:{id: 'GO:1902494'})(_204455104:GO {id: 'GO:0004553'}\n",
    "Sequence:UPI00013ED01D\n",
    "{UPI4Gv20696400} {comes from} how many (Species)?\n",
    "'''\n",
    "\n",
    "\n",
    "class entity_extract():\n",
    "    def __init__(self,question):\n",
    "        self.question=question\n",
    "    def get_id(self):\n",
    "        dictt=dict()\n",
    "        verb=self.question\n",
    "        verb=verb.split()\n",
    "        for i in verb:\n",
    "            if str(i).lstrip('[\\'').rstrip('\\']').strip('{').strip('}').strip('(').strip(')').rstrip('\\?').isalpha():\n",
    "                continue\n",
    "            elif str(i).lstrip('[\\'').rstrip('\\']').strip('{').strip('}').strip('(').strip(')').rstrip('\\?').isalnum():\n",
    "                if str(i).lstrip('[\\'').rstrip('\\']').strip('{').strip('}').strip('(').strip(')').rstrip('\\?').isdigit():\n",
    "                    a=verb.index(i)\n",
    "                    dictt['GO id']=verb[a]\n",
    "                elif str(i).lstrip('[\\'').rstrip('\\']').strip('{').strip('}').strip('(').strip(')').rstrip('\\?').startswith(('AET','AMTR','g','Al','fgenesh1','fgenesh2','scaffold','AT','BVRB','BRADI','GSBRNA2T','Bo','Bra','CHLRE','CHC','CCACVL','Csa','CM','DCAR','Dr','Gasu','GLYMA','B456','HannXRQ','HORVU','LPERR','TanjilG','MANES','MTR','GSMUA','A4A49','OBART','OB','ORGLA','OGLUM','KN','AMD','OMERI','ONIVA','OPUNC','ORUFI','BGIOSGA','Os','OSTLU','PHAVU','Pp','POPTR','PRUPE','SELMODRAFT','SETIT','Solyc','PGS','SORBI')):\n",
    "                    a=verb.index(i)\n",
    "                    dictt['Gene id']=verb[a]\n",
    "                elif str(i).lstrip('[\\'').rstrip('\\']').strip('{').strip('}').strip('(').strip(')').rstrip('\\?').startswith('UPI'):\n",
    "                    a=verb.index(i)\n",
    "                    dictt['Sequence id']=verb[a]\n",
    "                else:\n",
    "                    a=verb.index(i)\n",
    "                    dictt['Protein id']=verb[a]\n",
    "        return(dictt)\n",
    "    def get_species(self):\n",
    "        verb=self.question\n",
    "        species_type=[\"Aegilops tauschii\",\"Arabidopsis halleri\",\"Arabidopsis lyrata\",\"Amborella trichopoda\",\"Beta vulgaris\",\"Brassica rapa\",\"Chondrus crispus\",\"Corchorus capsularis\",\"Cyanidioschyzon\",\"Daucus carota\",\"Dioscorea rotundata\",\"Galdieria sulphuraria\",\"Gossypium raimondii\",\"Hordeum vulgare\",\"Oryza brachyantha\",\"Oryza glaberrima\",\"Oryza glumipatula\",\"Arabidopsis thaliana\",\"Brachypodium distachyon\",\"Brassica napus\",\"Brassica oleracea\",\"Chlamydomonas reinhardtii\",\"Cucumis sativus\",\"Glycine max\",\"Helianthus annuus\",\"Leersia perrieri\",\"Lupinus angustifolius\",\"Manihot esculenta\",\"Medicago truncatula\",\"Musa acuminata\",\"Nicotiana attenuata\",\"Oryza barthii\",\"Oryza longistaminata\",\"Oryza rufipogon\",\"Oryza sativa Indica Group\",\"Phaseolus vulgaris\",\"Populus trichocarpa\",\"Oryza meridionalis\",\"Oryza nivara\",\"Oryza punctata\",\"Oryza sativa Japonica Group\",\"Ostreococcus lucimarinus\",\"Physcomitrella patens\",\"Selaginella moellendorffii\",\"Setaria italica\",\"Solanum tuberosum\",\"Theobroma cacao\",\"Vigna angularis\",\"Vigna radiata\",\"Zea mays\",\"Prunus persica\",\"Solanum lycopersicum\",\"Sorghum bicolor\",\"Trifolium pratense\",\"Triticum aestivum\",\"Triticum dicoccoides\",\"Triticum urartu\",\"Vitis vinifera\"]\n",
    "        for i in species_type:\n",
    "            if i in verb:\n",
    "                return (i)\n",
    "            else:\n",
    "                return fuzzyfinder2(verb, species_type)\n",
    "    def get_goids(self):\n",
    "        goid=[]\n",
    "        verb=self.question\n",
    "        verb=verb.split()\n",
    "        for i in verb:\n",
    "            if str(i).lstrip('[\\'').rstrip('\\']').strip('{').strip('}').strip('(').strip(')').rstrip('\\?').isalpha():\n",
    "                continue\n",
    "            elif str(i).lstrip('[\\'').rstrip('\\']').strip('{').strip('}').strip('(').strip(')').rstrip('\\?').isalnum():\n",
    "                if str(i).lstrip('[\\'').rstrip('\\']').strip('{').strip('}').strip('(').strip(')').rstrip('\\?').isdigit():\n",
    "                    a=verb.index(i)\n",
    "                    goid.append(verb[a])\n",
    "        return(goid)\n",
    "#m=entity_extract('what genes do molecular function includes in Vitis vinifera ?')\n",
    "#print(m.get_species())\n",
    "#print('Vitis vinifera' in 'what genes do molecular function includes in Vitis vinifera ?')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "def AnswerQ(string,Question,num=5000):\n",
    "    if string=='have1':\n",
    "        body=entity_extract(Question)\n",
    "        species_type=str(body.get_species())\n",
    "        a='match(na:Species{{name:\"{species_type}\"}})-[have]->(nb:Gene) return nb.id limit {num}'.format(species_type=species_type,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        txt='The species '+str(species_type)+'have genes as follows:'\n",
    "        return(txt,b)\n",
    "    elif string=='have2':\n",
    "        #[have2] What species do gene id exist in?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['Gene id']\n",
    "        a='match(na:Species)-[have]->(nb:Gene{{id:\"{geneid}\"}}) return na.name limit {num}'.format(geneid=ids,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        txt='The gene id: '+str(ids)+' exist in these species:'\n",
    "        return(txt,b)\n",
    "    elif string=='be_transcribed_into1':\n",
    "        # [be_transcribed_into1] Gene id is transcribed into what sequence?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['Gene id']\n",
    "        a='match(na:Gene{{id:\"{geneid}\"}})-[be_transcribed_into]->(nb:Sequence) return nb.id limit {num}'.format(geneid=ids,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        if b.empty:\n",
    "            txt='Gene id: '+str(ids)+' is transcribed into none sequence.'\n",
    "            return(txt,b)\n",
    "        else:\n",
    "            txt='Gene id: '+str(ids)+' is transcribed into the sequence: '\n",
    "            return(txt,b)\n",
    "    elif string=='be_transcribed_into2':\n",
    "        #[be_transcribed_into2] Gene id is transcribed into what protein?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['Gene id']\n",
    "        a='match(na:Gene{{id:\"{geneid}\"}})-[be_transcribed_into]->(nb:Protein) return nb.id,nb.name limit {num}'.format(geneid=ids,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        if b.empty:\n",
    "            txt='Gene id: '+str(ids)+' is transcribed into none protein.'\n",
    "            return(txt,b)\n",
    "        else:\n",
    "            txt='Gene id: '+str(ids)+' is transcribed into the protein: '\n",
    "            return(txt,b)\n",
    "    elif string=='be_transcribed_into32':\n",
    "        #[be_transcribed_into3] sequence/protein id is transcribed from which gene?\n",
    "        body=entity_extract(Question)       \n",
    "        ids=body.get_id()['Protein id']\n",
    "        a='match(na:Gene)-[be_transcribed_into]->(nb:Protein{{id:\"{pid}\"}}) return na.id limit {num}'.format(pid=ids,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        if b.empty:\n",
    "            txt='There are no genes transcribing into the protein: '+str(ids)\n",
    "            return(txt,b)\n",
    "        else:\n",
    "            txt='The protein: '+str(ids)+' is transcribed from the genes as follows: '\n",
    "            return(txt,b)\n",
    "    elif string=='be_transcribed_into31':\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['Sequence id']\n",
    "        a='match(na:Gene)-[be_transcribed_into]->(nb:Sequence{{id:\"{sid}\"}}) return na.id limit {num}'.format(sid=ids,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        if b.empty:\n",
    "            txt='There are no genes transcribing into the sequence: '+str(ids)\n",
    "            return(txt,b)\n",
    "        else:\n",
    "            txt='The sequence: '+str(ids)+' is transcribed from the genes as follows: '\n",
    "            return(txt,b)\n",
    "    elif string=='is_a':\n",
    "        #[is_a] what is the GO that has relationship \"is a \" with GO id?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        a='match(na:GO{{id:\"GO:{gid}\"}})-[is_a]->(nb:GO) return nb.id limit {num}'.format(gid=ids,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        txt='The GO which has relationship \\\"is a \\\" with GO id: '+str(ids)+' is: '\n",
    "        return(txt,b)\n",
    "    elif string=='negatively_regulates':\n",
    "        #[negatively_regulates] what is the GO that has relationship \"negatively regulates \" with GO id?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        a='match(na:GO{{id:\"GO:{gid}\"}})-[negatively_regulates]->(nb:GO) return nb.id limit {num}'.format(gid=ids,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        txt='The GO which has relationship \\\"negatively regulates \\\" with GO id: '+str(ids)+' is: '\n",
    "        return(txt,b)\n",
    "    elif string=='positively_regulates':\n",
    "        #[positively_regulates] what is the GO that has relationship \"positively regulates \" with GO id?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        a='match(na:GO{{id:\"GO:{gid}\"}})-[positively_regulates]->(nb:GO) return nb.id limit {num}'.format(gid=ids,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        txt='The GO which has relationship \\\"positively regulates \\\" with GO id: '+str(ids)+' is: '\n",
    "        return(txt,b)\n",
    "    elif string=='regulates':\n",
    "        #[regulates] what is the GO that has relationship \"regulates \" with GO id?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        a='match(na:GO{{id:\"GO:{gid}\"}})-[regulates]->(nb:GO) return nb.id limit {num}'.format(gid=ids,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        txt='The GO which has relationship \\\" regulates \\\" with GO id: '+str(ids)+' is: '\n",
    "        return(txt,b)\n",
    "    elif string=='part_of':\n",
    "        #[part_of] what is the GO that has relationship \"part of\" with GO id?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        a='match(na:GO{{id:\"GO:{gid}\"}})-[part_of]->(nb:GO) return nb.id limit {num}'.format(gid=ids,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        txt='The GO which has relationship \\\" part of \\\" with GO id: '+str(ids)+' is: '\n",
    "        return(txt,b)\n",
    "    elif string=='molecular_function':\n",
    "        #[molecular_function] what genes do molecular function includes in Species?\n",
    "        body=entity_extract(Question)\n",
    "        species_type=str(body.get_species())\n",
    "        a='match(na:Gene{{species:\"{species_type}\"}})-[molecular_function]->(nb:GO) return na.id,na.species limit {num}'.format(species_type=species_type,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        txt='The genes which do molecular function includes in Species '+str(species_type)+'are as follows: '\n",
    "        return(txt,b)\n",
    "    elif string=='biological_process':\n",
    "        #[biological_process] what genes do biological process includes?\n",
    "        body=entity_extract(Question)\n",
    "        species_type=str(body.get_species())\n",
    "        a='match(na:Gene{{species:\"{species_type}\"}})-[biological_process]->(nb:GO) return na.id,na.species limit {num}'.format(species_type=species_type,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        txt='The genes which do biological process includes in Species '+str(species_type)+'are as follows: '\n",
    "        return(txt,b)\n",
    "    elif string=='cellular_component':\n",
    "        #[cellular_component] what genes do cellular component includes?\n",
    "        body=entity_extract(Question)\n",
    "        species_type=str(body.get_species())\n",
    "        a='match(na:Gene{{species:\"{species_type}\"}})-[cellular_component]->(nb:GO) return na.id,na.species limit {num}'.format(species_type=species_type,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        txt='The genes which do cellular component includes in Species '+str(species_type)+'are as follows: '\n",
    "        return(txt,b)\n",
    "    elif string=='eco':\n",
    "        #[eco] what genes is an evidence ontology in Species?\n",
    "        body=entity_extract(Question)\n",
    "        species_type=str(body.get_species())\n",
    "        a='match(na:Gene{{species:\"{species_type}\"}})-[eco]->(nb:GO) return na.id,na.species limit {num}'.format(species_type=species_type,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        txt='The genes which is an evidence ontology in Species '+str(species_type)+'are as follows: '\n",
    "        return(txt,b)\n",
    "    elif string=='belong_to':\n",
    "        #[belong_to] Sequence id belongs to which protein? \n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['Sequence id']\n",
    "        a='match(na:Sequence{{id:\"{sid}\"}})-[belong_to]->(nb:Protein) return nb.id limit {num}'.format(sid=ids,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        txt='Sequence id '+str(ids)+'belongs to the protein: '\n",
    "        return(txt,b)\n",
    "###########################新增\n",
    "    elif string=='eco1':\n",
    "        #[eco1]What genes are involved in the evidence and conclusion ontology of the gene ontology GO?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        a='MATCH (na:Gene)-[:eco]->(nb:GO{{id:\"GO:{gid}\"}}) return na.id limit {num}'.format(gid=ids,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        if b.empty:\n",
    "            txt='There are no genes involved in the evidence and conclusion ontology of the GO: '+str(ids)\n",
    "            return(txt,b)\n",
    "        else:\n",
    "            txt='The genes involved in the evidence and conclusion ontology of the GO: '+str(ids)+' are as follows:'\n",
    "            return(txt,b)\n",
    "    elif  string=='eco2':\n",
    "        #[eco2] How many genes are involved in the evidence and conclusion ontology of gene ontology GO ?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        a='MATCH (na:Gene)-[:eco]->(nb:GO{{id:\"GO:{gid}\"}}) return na.id '.format(gid=ids)\n",
    "        b=get_Answer(a)\n",
    "        if len(b):\n",
    "            txt='It has '+str(len(b))+' genes which are involved in the evidence and conclusion ontology of gene ontology GO: '+str(ids)+' ,as follows:'\n",
    "            return(txt,b)\n",
    "        else:\n",
    "            txt='NONE'\n",
    "            return(txt,b)\n",
    "    elif string=='eco3':\n",
    "        #[eco3] Does this gene participate in the evidence and conclusion ontology of gene ontology GO ?\n",
    "        body=entity_extract(Question)\n",
    "        gene_ids=body.get_id()['Gene id']\n",
    "        go_ids=body.get_id()['GO id']\n",
    "        a='MATCH (na:Gene{{id:\"{geneids}\"}}),(nb:GO{{id:\"GO:{goids}\"}}),p=(na)-[:eco]-(nb) return count(p)'.format(geneids=gene_ids,goids=go_ids)\n",
    "        b=get_Answer(a)\n",
    "        d=pd.DataFrame()        \n",
    "        if b['count(p)'][0]:\n",
    "            txt='Yes,it  participate in the evidence and conclusion ontology of gene ontology GO: '+str(go_ids)\n",
    "        else:\n",
    "            txt='NO'\n",
    "        return(txt,d)\n",
    "    elif string=='biological_process1':\n",
    "        #What genes are involved in this biological process of the gene ontology GO ?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        a='MATCH (na:Gene)-[:biological_process]->(nb:GO{{id:\"GO:{gid}\"}}) return na.id '.format(gid=ids,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        if b.empty:\n",
    "            txt='There are no genes involved in this biological process of the gene ontology GO: '+str(ids)\n",
    "            return(txt,b)\n",
    "        else:\n",
    "            txt='The genes involved in this biological process of the gene ontology GO: '+str(ids)+' are as follows:'\n",
    "            return(txt,b)\n",
    "    elif string=='biological_process2':\n",
    "        #How many genes are involved in this biological process of gene ontology?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        a='MATCH (na:Gene)-[:biological_process]->(nb:GO{{id:\"GO:{gid}\"}}) return na.id '.format(gid=ids)\n",
    "        b=get_Answer(a)\n",
    "        if len(b):\n",
    "            txt='It has '+str(len(b))+' genes which are involved in the biological process of gene ontology GO: '+str(ids)+' ,as follows:'\n",
    "            return(txt,b)\n",
    "        else:\n",
    "            txt='NONE'\n",
    "            return(txt,b)\n",
    "    elif string=='biological_process3':\n",
    "        #Does this gene participate in this biological process of gene ontology GO ?\n",
    "        body=entity_extract(Question)\n",
    "        gene_ids=body.get_id()['Gene id']\n",
    "        go_ids=body.get_id()['GO id']\n",
    "        a='MATCH (na:Gene{{id:\"{geneids}\"}}),(nb:GO{{id:\"GO:{goids}\"}}),p=(na)-[:biological_process]-(nb) return count(p)'.format(geneids=gene_ids,goids=go_ids)\n",
    "        b=get_Answer(a)\n",
    "        d=pd.DataFrame()\n",
    "        if b['count(p)'][0]:\n",
    "            txt='Yes,it participate in the biological process of gene ontology GO: '+str(go_ids)\n",
    "        else:\n",
    "            txt='NO'\n",
    "        return(txt,d)\n",
    "    elif string=='cellular_component1':\n",
    "        #What genes are contained in the cellular components of the gene ontology GO ?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        a='MATCH (na:Gene)-[:cellular_component]->(nb:GO{{id:\"GO:{gid}\"}}) return na.id '.format(gid=ids,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        if b.empty:\n",
    "            txt='There are no genes contained in the cellular components of the GO: '+str(ids)\n",
    "            return(txt,b)\n",
    "        else:\n",
    "            txt='The genes contained in the cellular components of the GO: '+str(ids)+' are as follows:'\n",
    "            return(txt,b)\n",
    "    elif string=='cellular_component2':\n",
    "        #How many genes are contained in the cellular components of gene ontology GO ?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        a='MATCH (na:Gene)-[:cellular_component]->(nb:GO{{id:\"GO:{gid}\"}}) return na.id '.format(gid=ids)\n",
    "        b=get_Answer(a)\n",
    "        if len(b):\n",
    "            txt='It has '+str(len(b))+' genes which are contained in the cellular components of gene ontology GO: '+str(ids)+' ,as follows:'\n",
    "            return(txt,b)\n",
    "        else:\n",
    "            txt='NONE'\n",
    "            return(txt,b)\n",
    "    elif string=='cellular_component3':\n",
    "        #Does the cell component of gene ontology GO contain this gene ?\n",
    "        body=entity_extract(Question)\n",
    "        gene_ids=body.get_id()['Gene id']\n",
    "        go_ids=body.get_id()['GO id']\n",
    "        a='MATCH (na:Gene{{id:\"{geneids}\"}}),(nb:GO{{id:\"GO:{goids}\"}}),p=(na)-[:cellular_component]-(nb) return count(p)'.format(geneids=gene_ids,goids=go_ids)\n",
    "        b=get_Answer(a)\n",
    "        d=pd.DataFrame()\n",
    "        if b['count(p)'][0]:\n",
    "            txt='Yes,the cell component of gene ontology GO '+str(go_ids)+' contain this gene '+str(gene_ids)\n",
    "        else:\n",
    "            txt='NO'\n",
    "        return(txt,d)\n",
    "    elif string=='molecular_function1':\n",
    "        #Which genes perform molecular functions on this gene ontology GO ?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        a='MATCH (na:Gene)-[:molecular_function]->(nb:GO{{id:\"GO:{gid}\"}}) return na.id '.format(gid=ids,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        if b.empty:\n",
    "            txt='The GO: '+str(ids)+' has no genes which perform molecular functions.'\n",
    "            return(txt,b)\n",
    "        else:\n",
    "            txt='The genes which perform molecular functions on the GO: '+str(ids)+' are as follows:'\n",
    "            return(txt,b)\n",
    "    elif string=='molecular_function2':\n",
    "        #How many genes perform molecular functions on this gene ontology GO ?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        a='MATCH (na:Gene)-[:molecular_function]->(nb:GO{{id:\"GO:{gid}\"}}) return na.id '.format(gid=ids)\n",
    "        b=get_Answer(a)\n",
    "        if len(b):\n",
    "            txt='It has '+str(len(b))+' genes performing molecular functions on the gene ontology GO: '+str(ids)+',as follows:'\n",
    "            return(txt,b)\n",
    "        else:\n",
    "            txt='NONE'\n",
    "            return(txt,b)\n",
    "    elif string=='molecular_function3':\n",
    "        #Does this gene perform molecular functions on this gene ontology GO ?\n",
    "        body=entity_extract(Question)\n",
    "        gene_ids=body.get_id()['Gene id']\n",
    "        go_ids=body.get_id()['GO id']\n",
    "        a='MATCH (na:Gene{{id:\"{geneids}\"}}),(nb:GO{{id:\"GO:{goids}\"}}),p=(na)-[:molecular_function]-(nb) return count(p)'.format(geneids=gene_ids,goids=go_ids)\n",
    "        b=get_Answer(a)\n",
    "        d=pd.DataFrame()\n",
    "        if b['count(p)'][0]:\n",
    "            txt='Yes,the cell component of gene ontology GO: '+str(go_ids)+' contain this gene '+str(gene_ids)\n",
    "        else:\n",
    "            txt='NO'\n",
    "        return(txt,d)\n",
    "    elif string=='have3':\n",
    "        #Does this gene exist in this species ?\n",
    "        body=entity_extract(Question)\n",
    "        gene_ids=body.get_id()['Gene id']\n",
    "        species_type=str(body.get_species())\n",
    "        a='match (na:Species{{name:\"{species_type}\"}}),(nb:Gene{{id:\"{geneids}\"}}),p=(na)-[:have]-(nb) return count(p)'.format(species_type=species_type,geneids=gene_ids)\n",
    "        b=get_Answer(a)\n",
    "        d=pd.DataFrame()\n",
    "        if b['count(p)'][0]:\n",
    "            txt='Yes,the gene '+str(gene_ids)+' exist in the species '+str(species_type)\n",
    "            return(txt,d)\n",
    "        else:\n",
    "            txt='NO'\n",
    "        return(txt,d)\n",
    "    elif string=='have4':\n",
    "        #How many genes exist in this species ?\n",
    "        body=entity_extract(Question)\n",
    "        species_type=str(body.get_species())\n",
    "        a='MATCH (na:Species{{name:\"{species_type}\"}})-[:have]->(nb:Gene) return nb.id '.format(species_type=species_type)\n",
    "        b=get_Answer(a)\n",
    "        if len(b):\n",
    "            txt='It has '+str(len(b))+' genes existing in the species '+str(species_type)+' ,as follows:'\n",
    "            return(txt,b)\n",
    "        else:\n",
    "            txt='NONE'\n",
    "            return(txt,b)\n",
    "    elif string=='is_a1':\n",
    "        #What are the subtype of this gene ontology GO ?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        a='match(na:GO)-[is_a]->(nb:GO{{id:\"GO:{gid}\"}}) return na.id limit {num}'.format(gid=ids,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        if b.empty:\n",
    "            txt='The GO: '+str(ids)+' has no subtype.'\n",
    "            return(txt,b)\n",
    "        else:\n",
    "            txt='The subtype of this GO: '+str(ids)+' is as follows:'\n",
    "            return(txt,b)\n",
    "    elif string=='is_a2':\n",
    "        #How many subcategories are there in this gene ontology GO ? \n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        a='MATCH (na:GO)-[:is_a]->(nb:GO{{id:\"GO:{gid}\"}}) return na.id '.format(gid=ids)\n",
    "        b=get_Answer(a)\n",
    "        if len(b):\n",
    "            txt='It has '+str(len(b))+' subcategories in the gene ontology GO：'+str(ids)+',as follows:'\n",
    "            return(txt,b)\n",
    "        else:\n",
    "            txt='NONE'\n",
    "            return(txt,b)\n",
    "    elif string=='is_a3':\n",
    "        #Is this gene ontology GO a subcategory of the gene ontology GO ?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_goids()\n",
    "        subgoids=ids[0]\n",
    "        goids=ids[1]\n",
    "        a='MATCH (na:GO{{id:\"GO:{subgid}\"}}),(nb:GO{{id:\"GO:{gid}\"}}),p=(na)-[:is_a]-(nb) return count(p)'.format(subgid=subgoids,gid=goids)\n",
    "        b=get_Answer(a)\n",
    "        d=pd.DataFrame()\n",
    "        if b['count(p)'][0]:\n",
    "            txt='Yes,the GO: '+str(subgoids)+' is a subcategory of the GO: '+str(goids)\n",
    "        else:\n",
    "            txt='NO'\n",
    "        return(txt,d)\n",
    "    elif string=='part_of1':\n",
    "        #What part of this gene ontology GO ?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        a='match(na:GO)-[:part_of]->(nb:GO{{id:\"GO:{gid}\"}}) return na.id limit {num}'.format(gid=ids,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        if b.empty:\n",
    "            txt='The GO: '+str(ids)+' has no part.'\n",
    "            return(txt,b)\n",
    "        else:\n",
    "            txt='The part of this GO: '+str(ids)+' is as follows: '\n",
    "            return(txt,b)\n",
    "    elif string=='part_of2':\n",
    "        #How many parts of this gene ontology GO are there?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        a='MATCH (na:GO)-[:part_of]->(nb:GO{{id:\"GO:{gid}\"}}) return na.id '.format(gid=ids)\n",
    "        b=get_Answer(a)\n",
    "        if len(b):\n",
    "            txt='There are '+str(len(b))+' parts of GO: '+str(ids)+' ,as follows:'\n",
    "            return(txt,b)\n",
    "        else:\n",
    "            txt='NONE'\n",
    "            return(txt,b)\n",
    "    elif string=='part_of3':\n",
    "        #This gene ontology GO is part of which gene ontology GO ?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        a='MATCH (na:GO{{id:\"GO:{gid}\"}})-[:part_of]->(nb:GO) return na.id '.format(gid=ids)\n",
    "        b=get_Answer(a)\n",
    "        if len(b):\n",
    "            txt='The GO: '+str(ids)+' is part of these gene ontologys,as follows:'\n",
    "        else:\n",
    "            txt='NONE'\n",
    "        return(txt,b)\n",
    "    elif string=='part_of4':\n",
    "        #Is this gene ontology GO part of that gene ontology GO ? \n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_goids()\n",
    "        subgoids=ids[0]\n",
    "        goids=ids[1]\n",
    "        a='MATCH (na:GO{{id:\"GO:{subgid}\"}}),(nb:GO{{id:\"GO:{gid}\"}}),p=(na)-[:part_of]-(nb) return count(p)'.format(subgid=subgoids,gid=goids)\n",
    "        b=get_Answer(a)\n",
    "        d=pd.DataFrame()\n",
    "        if b['count(p)'][0]:\n",
    "            txt='Yes,the GO: '+str(subgoids)+' is part of the GO: '+str(goids)\n",
    "        else:\n",
    "            txt='NO'\n",
    "        return(txt,d)\n",
    "    elif string=='regulates1':\n",
    "        #Which gene ontology GO does the gene ontology GO regulate?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        txt='The GO: '+str(ids)+' regulates the gene ontologies,as follows:'\n",
    "        a='match(na:GO{{id:\"GO:{gid}\"}})-[:regulates]->(nb:GO) return nb.id limit {num}'.format(gid=ids,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        return(txt,b)\n",
    "    elif string=='regulates2':\n",
    "        #Does the gene ontology GO regulate the gene ontology GO ? \n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_goids()\n",
    "        goids=ids[0]\n",
    "        subgoids=ids[1]\n",
    "        a='MATCH (na:GO{{id:\"GO:{gid}\"}}),(nb:GO{{id:\"GO:{subgid}\"}}),p=(na)-[:regulates]-(nb) return count(p)'.format(gid=goids,subgid=subgoids)\n",
    "        b=get_Answer(a)\n",
    "        d=pd.DataFrame()\n",
    "        if b['count(p)'][0]:\n",
    "            txt='Yes,the GO: '+str(goids)+' regulate the gene ontology GO: '+str(subgoids)\n",
    "        else:\n",
    "            txt='NO'\n",
    "        return(txt,d)\n",
    "    elif string=='regulates3':\n",
    "        #How many gene ontologies GO does this gene ontology GO regulate?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        a='MATCH (na:GO{{id:\"GO:{gid}\"}})-[:regulates]->(nb:GO) return nb.id '.format(gid=ids)\n",
    "        b=get_Answer(a)\n",
    "        if len(b):\n",
    "            txt='GO: '+str(ids)+' regulates '+str(len(b))+' gene ontologies,as follows:'\n",
    "            return(txt,b)\n",
    "        else:\n",
    "            txt='NONE'\n",
    "            return(txt,b)\n",
    "    elif string=='regulates4':\n",
    "        #Which gene ontology GO has a regulatory effect ?\n",
    "        a='MATCH (na:GO)-[r:regulates]->(nb:GO) RETURN na.id'\n",
    "        b=get_Answer(a)\n",
    "        txt='GO have a regulatory effect:'\n",
    "        return(txt,b)\n",
    "    elif string=='positively_regulates1':\n",
    "        #Which gene ontology GO does the gene ontology positive regulate ?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        txt='The GO: '+str(ids)+' positively regulates the gene ontologies,as follows:'\n",
    "        a='match(na:GO{{id:\"GO:{gid}\"}})-[:positively_regulates]->(nb:GO) return nb.id limit {num}'.format(gid=ids,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        return(txt,b)\n",
    "    elif string=='positively_regulates2':\n",
    "        #Does the gene ontology GO positive regulate the gene ontology GO ?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_goids()\n",
    "        goids=ids[0]\n",
    "        subgoids=ids[1]\n",
    "        a='MATCH (na:GO{{id:\"GO:{gid}\"}}),(nb:GO{{id:\"GO:{subgid}\"}}),p=(na)-[:positively_regulates]-(nb) return count(p)'.format(gid=goids,subgid=subgoids)\n",
    "        b=get_Answer(a)\n",
    "        d=pd.DataFrame()\n",
    "        if b['count(p)'][0]:\n",
    "            txt='Yes,the GO: '+str(goids)+' positively regulate the gene ontology GO: '+str(subgoids)\n",
    "        else:\n",
    "            txt='NO'\n",
    "        return(txt,d)\n",
    "    elif string=='positively_regulates3':\n",
    "        #How many gene ontologies GO does this gene ontology GO positive regulate ?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        a='MATCH (na:GO{{id:\"GO:{gid}\"}})-[:positively_regulates]->(nb:GO) return nb.id '.format(gid=ids)\n",
    "        b=get_Answer(a)\n",
    "        if len(b):\n",
    "            txt='GO: '+str(ids)+' positively regulates '+str(len(b))+' gene ontologies,as follows:'\n",
    "            return(txt,b)\n",
    "        else:\n",
    "            txt='NONE'\n",
    "            return(txt,b)\n",
    "    elif string=='positively_regulates4':\n",
    "        #Which gene ontology has a positive regulatory effect ?\n",
    "        a='MATCH (na:GO)-[r:positively_regulates]->(nb:GO) RETURN na.id'\n",
    "        b=get_Answer(a)\n",
    "        txt='GO have a positive regulatory effect:'\n",
    "        return(txt,b)\n",
    "    elif string=='negatively_regulates1':\n",
    "        #Which gene ontology GO does the gene ontology negative regulate ?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        txt='The GO: '+str(ids)+' negatively regulates the gene ontologies,as follows:'\n",
    "        a='match(na:GO{{id:\"GO:{gid}\"}})-[:negatively_regulates]->(nb:GO) return nb.id limit {num}'.format(gid=ids,num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        return(txt,b)\n",
    "    elif string=='negatively_regulates2':\n",
    "        #Does the gene ontology GO negative regulate the gene ontology GO ?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_goids()\n",
    "        goids=ids[0]\n",
    "        subgoids=ids[1]\n",
    "        a='MATCH (na:GO{{id:\"GO:{gid}\"}}),(nb:GO{{id:\"GO:{subgid}\"}}),p=(na)-[:negatively_regulates]-(nb) return count(p)'.format(gid=goids,subgid=subgoids)\n",
    "        b=get_Answer(a)\n",
    "        d=pd.DataFrame()\n",
    "        if b['count(p)'][0]:\n",
    "            txt='Yes,the GO: '+str(goids)+' negatively regulate the gene ontology GO: '+str(subgoids)\n",
    "        else:\n",
    "            txt='NO'\n",
    "        return(txt,d)\n",
    "    elif string=='negatively_regulates3':\n",
    "        #How many gene ontologies GO does the gene ontology GO negative regulate ?\n",
    "        body=entity_extract(Question)\n",
    "        ids=body.get_id()['GO id']\n",
    "        a='MATCH (na:GO{{id:\"GO:{gid}\"}})-[:negatively_regulates]->(nb:GO) return nb.id '.format(gid=ids)\n",
    "        b=get_Answer(a)\n",
    "        if len(b):\n",
    "            txt='GO: '+str(ids)+' negatively regulates '+str(len(b))+' gene ontologies,as follows:'\n",
    "            return(txt,b)\n",
    "        else:\n",
    "            txt='NONE'\n",
    "            return(txt,b)\n",
    "    elif string=='negatively_regulates4':\n",
    "        #Which gene ontology has a negative regulatory effect ?\n",
    "        a='MATCH (na:GO)-[r:negatively_regulates]->(nb:GO) RETURN na.id'\n",
    "        b=get_Answer(a)\n",
    "        txt='GO have a negative regulatory effect:'\n",
    "        return(txt,b)\n",
    "    elif string=='species_graph':\n",
    "        #What species are in the biological gene graph ?\n",
    "        a='MATCH (na:Species) return na.name limit {num}'.format(num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        txt='The species in the biological gene graph are as follows:'\n",
    "        return(txt,b)\n",
    "    elif string=='genes_graph':\n",
    "        #What genes are in the biological gene graph ?\n",
    "        a='MATCH (na:Gene) return na.id limit {num}'.format(num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        txt='The genes in the biological gene graph are as follows:'\n",
    "        return(txt,b)\n",
    "    elif string=='go_graph':\n",
    "        #What gene ontologies GO are in the biological gene graph ?\n",
    "        a='MATCH (na:GO) return na.id limit {num}'.format(num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        txt='The gene ontologies in the biological gene graph are as follows:'\n",
    "        return(txt,b)\n",
    "    elif string=='sequences_graph':\n",
    "        #What sequences are in the biological gene graph ?\n",
    "        a='MATCH (na:Sequence) return na.id limit {num}'.format(num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        txt='The sequences in the biological gene graph are as follows:'\n",
    "        return(txt,b)\n",
    "    elif string=='proteins_graph':\n",
    "        #What proteins are in the biological gene graph ?\n",
    "        a='MATCH (na:Protein) return na.id limit {num}'.format(num=str(num))\n",
    "        b=get_Answer(a)\n",
    "        txt='The proteins in the biological gene graph are as follows:'\n",
    "        return(txt,b)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "'''\n",
    "%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%\n",
    "BOSS函数！！！！！\n",
    "%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%\n",
    "\n",
    "\n",
    "示例Q='{Aegilops tauschii} has how many genes?'\n",
    "（因为只有这个句子算是写好了）\n",
    "\n",
    "'''\n",
    "def run():\n",
    "    Q=input('Enter your Question:')\n",
    "    Question=realQ(Q)\n",
    "    qpattern_dir=\"question_pattern.txt\"\n",
    "    m=max_sim(Question,qpattern_dir)\n",
    "    txt,verb=AnswerQ(m,Q)# [,num=5000]\n",
    "    print(txt)\n",
    "    if verb.empty:\n",
    "        return\n",
    "    else:\n",
    "        print(verb)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Enter your Question:Does the gene ontology GO 0006351 regulate that gene ontology GO 0006355 ? \n",
      "Yes,the GO: 0006351 regulate the gene ontology GO: 0006355\n"
     ]
    }
   ],
   "source": [
    "'''\n",
    "例子：{Aegilops tauschii} {have} how many (Genes)?\n",
    "What species do gene AET4Gv20696400 exist in?\n",
    "\n",
    "Gene Os01g0740400 is transcribed into what sequence?\n",
    "Gene id BGIOSGA035786 is transcribed into what protein?\n",
    "sequence UPI00004C2817 is transcribed from which gene?\n",
    "\n",
    "what is the GO that has relationship \"is a \" with GO 0060255 ?\n",
    "what is the GO that has relationship \"negatively regulates \" with GO 0000086 ?\n",
    "what genes do molecular function includes in Vitis vinifera?\n",
    "what genes is an evidence ontology in Sorghum bicolor?\n",
    "Sequence UPI0000000444 belongs to which protein? \n",
    "\n",
    "What genes are involved in the evidence and conclusion ontology of the gene ontology GO 0043234 ?\n",
    "How many genes are involved in the evidence and conclusion ontology of gene ontology GO 0043234 ?\n",
    "Does the gene Bra023371 participate in the evidence and conclusion ontology of gene ontology GO 0043234 ?\n",
    "\n",
    "What genes are involved in this biological process of the gene ontology GO 0006281 ?\n",
    "How many genes are involved in this biological process of gene ontology GO 0006281 ?  \n",
    "Does this gene AET5Gv20554800 participate in this biological process of gene ontology GO 0055114 ?\n",
    "\n",
    "What genes are contained in the cellular components of the gene ontology GO 0009941 ?\n",
    "How many genes are contained in the cellular components of gene ontology GO 0009941 ?\n",
    "Does the cell component of gene ontology GO 0009941 contain this gene AET4Gv20696400 ?\n",
    "\n",
    "Which genes perform molecular functions on this gene ontology GO 0019706 ?\n",
    "How many genes perform molecular functions on this gene ontology GO 0005515 ?\n",
    "Does this gene AET3Gv21167000 perform molecular functions on this gene ontology GO 0005515 ?\n",
    "\n",
    "Does this gene AET4Gv20649600 exist in this species Aegilops tauschii ?\n",
    "How many genes exist in this species Brassica napus ?\n",
    "\n",
    "What are the subtype of this gene ontology GO 0051052 ?\n",
    "How many subcategories are there in this gene ontology GO 0051052 ? \n",
    "Is this gene ontology GO 0060255  a subcategory of the gene ontology GO 0051052 ?\n",
    "\n",
    "What part of this gene ontology GO 0006886 ?\n",
    "How many parts of this gene ontology GO 0051318 are there?\n",
    "This gene ontology GO 0042254 is part of which gene ontology GO ?\n",
    "Is this gene ontology GO 0034613 part of that gene ontology GO 0006886 ? \n",
    "\n",
    "Which gene ontology GO does the gene ontology GO 0006351 regulate?\n",
    "Does the gene ontology GO 0006351 regulate that gene ontology GO 0006355 ? \n",
    "How many gene ontologies GO does this gene ontology GO 0006366 regulate?\n",
    "Which gene ontology GO has a regulatory effect ?\n",
    "\n",
    "Which gene ontology GO does the gene ontology GO 0023052 positive regulate ?\n",
    "Does the gene ontology GO 0044700 positive regulate the gene ontology GO 0023056 ?\n",
    "How many gene ontologies GO does this gene ontology GO 0044700 positive regulate ?\n",
    "Which gene ontology has a positive regulatory effect ?\n",
    "\n",
    "Which gene ontology GO does the gene ontology GO 0006351 negative regulate ?\n",
    "Does the gene ontology GO 0006351 negative regulate the gene ontology GO 0045892 ?\n",
    "How many gene ontologies GO does the gene ontology GO 0006351 negative regulate ?\n",
    "Which gene ontology has a negative regulatory effect ?\n",
    "\n",
    "What species are in the biological gene graph ?\n",
    "What genes are in the biological gene graph ?\n",
    "What gene ontologies GO are in the biological gene graph ?\n",
    "What sequences are in the biological gene graph ?\n",
    "What proteins are in the biological gene graph ?\n",
    "运行函数\n",
    "\n",
    "'''\n",
    "if __name__==\"__main__\":\n",
    "    run()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 192,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nb.id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>UPI00004C2817</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           nb.id\n",
       "0  UPI00004C2817"
      ]
     },
     "execution_count": 192,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "a=\"MATCH (Species)-[:have]->(Gene) where Gene.id=\\\"{geneid}\\\" RETURN Species LIMIT {num}\"\n",
    "txt='match(na:Species)-[:have]->(nb:Gene{id:\"AET4Gv20696400\"}) return na.name limit 10'\n",
    "ar='match(na:Gene{id:\"Os01g0740400\"})-[be_transcribed_into]->(nb:Sequence) return nb.id limit 10'\n",
    "get_Answer(ar)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "pip install python-Levenshtein"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['0060255', '0051052']\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'0060255'"
      ]
     },
     "execution_count": 82,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "b='Is this gene ontology GO 0060255  a subcategory of the gene ontology GO 0051052 ?'\n",
    "c=entity_extract(b)\n",
    "subd=c.get_goids()\n",
    "print(subd)\n",
    "subd[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [],
   "source": [
    "txt='match(na:Species)-[:have]->(nb:Gene) return na.name limit 10'\n",
    "c=get_Answer(txt)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "pandas.core.frame.DataFrame"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "type(c)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
